OpenFOAM/OpenFOAM-7/tutorials/multiphase/cavitatingFoam/LES/throttle3D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Set application name
application=$(getApplication)

refineMeshByCellSet()
{
   while [ $# -ge 1 ]
   do
      if [ ! -e log.refineMesh.$1 ]
      then
          echo "Creating cell set for primary zone - $1"
          cp system/topoSetDict.$1 system/topoSetDict
          topoSet > log.topoSet.$1 2>&1

          echo "Refining primary zone - $1"
          refineMesh -dict system/refineMeshDict -overwrite \
              > log.refineMesh.$1 2>&1
      fi
      shift
   done
}

runApplication blockMesh
refineMeshByCellSet 1 2 3

#echo "mapping fields from 2D throttle case"
#runApplication mapFields ../throttle -sourceTime latestTime

runApplication decomposePar
runParallel $application
runApplication reconstructPar

#------------------------------------------------------------------------------
